Repository: CofficLab/Lumi
Catalog: Packages/PluginLLMContext/Sources/PluginLLMContext/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: %lld compactions
zh_hans: %lld 次压缩
zh_hk: %lld 次壓縮

source: An emergency compaction was requested to keep the next request safe.
zh_hans: 为保证下一次请求安全，执行了紧急压缩。
zh_hk: 為保證下一次請求安全，執行了緊急壓縮。

source: Context Window
zh_hans: 上下文窗口
zh_hk: 上下文視窗

source: Context compaction
zh_hans: 上下文压缩
zh_hk: 上下文壓縮

source: Context usage trend
zh_hans: 上下文使用趋势
zh_hk: 上下文使用趨勢

source: Context window
zh_hans: 上下文窗口
zh_hk: 上下文視窗

source: Context window size is unknown
zh_hans: 上下文窗口大小未知
zh_hk: 上下文視窗大小未知

source: Context window: %@ tokens
zh_hans: 上下文窗口：%@ tokens
zh_hk: 上下文視窗：%@ tokens

source: Context: Unknown
zh_hans: 上下文：未知
zh_hk: 上下文：未知

source: Conversation compacted
zh_hans: 会话已压缩
zh_hk: 對話已壓縮

source: Emergency
zh_hans: 紧急
zh_hk: 緊急

source: Estimated input
zh_hans: 估算输入
zh_hk: 估算輸入

source: Estimated input: %@ / %@ context window
zh_hans: 估算输入：%@ / %@ 上下文窗口
zh_hk: 估算輸入：%@ / %@ 上下文視窗

source: Estimated input: %@ tokens
zh_hans: 估算输入：%@ tokens
zh_hk: 估算輸入：%@ tokens

source: LLMContext input budget
zh_hans: LLMContext 输入预算
zh_hk: LLMContext 輸入預算

source: Legacy
zh_hans: 历史记录
zh_hk: 歷史記錄

source: Max
zh_hans: 最大
zh_hk: 最大

source: Min
zh_hans: 最小
zh_hk: 最小

source: Model window unknown; using a %@ fallback.
zh_hans: 模型窗口未知，使用 %@ 作为估算值。
zh_hk: 模型視窗未知，使用 %@ 作為估算值。

source: No token usage data yet
zh_hans: 暂无令牌使用数据
zh_hk: 暫無權杖使用資料

source: No usage history yet
zh_hans: 暂无使用历史
zh_hk: 暫無使用歷史

source: Requests
zh_hans: 请求次数
zh_hk: 請求次數

source: Retry
zh_hans: 超限重试
zh_hk: 超限重試

source: Some points are estimated locally because the provider did not report usage.
zh_hans: 部分点由本地估算，因为供应商未上报用量。
zh_hk: 部分點由本地估算，因為供應商未上報用量。

source: The input budget reached the hard threshold.
zh_hans: 输入预算达到硬阈值后进行了压缩。
zh_hk: 輸入預算達到硬閾值後進行了壓縮。

source: The provider rejected the context size, so Lumi compacted and retried.
zh_hans: 供应商返回上下文长度超限，Lumi 压缩后重新尝试。
zh_hk: 供應商回報上下文長度超限，Lumi 壓縮後重新嘗試。

source: This record was created before detailed compaction information was saved.
zh_hans: 这条记录创建于详细压缩信息保存之前。
zh_hk: 這條記錄建立於詳細壓縮資訊儲存之前。

source: Threshold
zh_hans: 达到阈值
zh_hk: 達到閾值

source: Unknown
zh_hans: 未知
zh_hk: 未知

source: Unknown context window
zh_hans: 上下文窗口未知
zh_hk: 上下文視窗未知

source: Unknown model
zh_hans: 未知模型
zh_hk: 未知模型

source: input budget
zh_hans: 输入预算
zh_hk: 輸入預算
